# YOLOv8-seg 布匹检测优化版
nc: 7
scales:
  n: [0.33, 0.25, 1024]

#anchors:
#  # 适配3072x96输入下采样后的特征图
#  - [(384, 2), (384, 2), (384, 2)]  # stride=8的特征图
#  - [(192, 2), (192, 2), (192, 2)]  # stride=16
#  - [(96, 2), (96, 2), (96, 2)]     # stride=32
#  - [(2, 12), (2, 12), (2, 12)]
#  - [(2, 6), (2, 6), (2, 6)]
#  - [(2, 3), (2, 3), (2, 3)]
#  - [(6, 6), (12, 12), (24, 24)]

#anchors:
#  - [5,5,  10,5,  20,5]      # 小目标层（检测5×5）
#  - [96,5, 200,5, 500,5]     # 中等目标层（检测96×2）
#  - [1000,5, 2000,5, 3000,5] # 大目标层（检测3072×2）

anchions:
#  - [10,13, 16,30, 33,23]    # 对应特征图P3/8（小目标）
#  - [30,61, 62,45, 59,119]   # 对应特征图P4/16（中目标）
#  - [116,90, 156,198, 373,326]  # 对应特征图P5/32（大
  # 适配3072x96输入下采样后的特征图
#  - [(384, 2), (384, 2), (384, 2)]  # stride=8的特征图
#  - [(192, 2), (192, 2), (192, 2)]  # stride=16
#  - [(96, 2), (96, 2), (96, 2)]     # stride=32
#  - [(2, 12), (2, 12), (2, 12)]
#  - [(2, 6), (2, 6), (2, 6)]
#  - [(2, 3), (2, 3), (2, 3)]
#  - [(6, 6), (12, 12), (24, 24)]
  - [[363,4], [360,11], [133,2]]  # P3/s=8
  - [[25,1], [6,1], [2,1]]  # P4/s=16
  - [[1,1], [1,3], [1,0]]  # P5/s=32
args:
  autoanchor: false  # 禁用自动锚框

#anchors:
#  # 适配3072x96输入下采样后的特征图
#  - [(2, 384), (2, 384), (2, 384)]  # stride=8的特征图
#  - [(2, 192), (2, 192), (2, 192)]  # stride=16
#  - [(2, 96), (2, 96), (2, 96)]     # stride=32
#  - [(12, 2), (12, 2), (12, 2)]
#  - [(6, 2), (6, 2), (6, 2)]
#  - [(3, 2), (3, 2), (3, 2)]
#  - [(6, 6), (12, 12), (24, 24)]


backbone:
  # [from, repeats, module, args]
  - [-1, 1, MorphologicalPreprocess, [3, 16]]  # 0-P0/1
  - [-1, 1, Conv, [64, 3, 2]]          # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 3-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]         # 4-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]         # 6-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, MSECSP, [1024]]                    # 10-P4/16

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]                # 12-融合P3
  - [-1, 3, VoVGSCSP, [512]]                      # 13-融合P3
#  - [-1, 1, CBAM, [512]]                     # 12-融合P3

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]                # 15-融合P2
  - [-1, 3, VoVGSCSP, [256]]                     # 16-融合P2

  - [-1, 1, GSConv, [256, 3, 2]]
  - [[-1, 13, 7], 1, Concat, [1]]               # 18-融合中层特征
  - [-1, 3, VoVGSCSP, [512]]                     # 19-融合P3

  - [-1, 1, GSConv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]               # 21-融合深层特征
  - [-1, 3, VoVGSCSP, [1024]]                   # 22-融合深层特征


#  - [8, 1, Conv, [512, 3, 2]]         # 22-P4/16
#  - [-1, 6, C2f, [512, True]]         # 23-P4/16
#  - [21, 1, Conv, [512, 3, 2]]
#  - [[-1, 23], 1, Concat, [1]]       # cat head P5
#  - [-1, 3, C2f, [1024]]             # 26 (P5/32-large)

#  - [8, 1, nn.Upsample, [None, 2, "nearest"]]
#  - [[-1, 5], 1, Concat, [1]]                # 10-融合P3
#  - [-1, 3, C2f, [256]]

#  - [8, 1, Conv, [512, 3, 2]]
##  - [[-1, 8], 1, Concat, [1]]               # 20-融合深层特征
#  - [-1, 3, C2f, [1024]]

  - [[16, 19, 22], 1, Detect, [nc]]          # 28-多尺度检测头